#include "..\\HoBaram\\HoTextFile.h"

char *HoTextLoginMessage[16] =  {
		"      正在連接伺服器，請稍候……    ",
		"      無法連接伺服器       ",
		"   帳號錯誤，請重新輸入  ",
		"密碼錯誤，請重新輸入",
		"   你沒有連接到這個伺服器的權利  ",
		"   這個帳號已在使用中   ",
		"  您的版本太舊，請先執行更新程式  ",
		"   伺服器已達人數上限，請稍候再試  ",
		"與伺服器的連線已中斷"
		"您的遊戲點數不足，請上官網查詢",
		"您尚未選擇計費模式，請上官網設定",
		" 正在向伺服器申請刪除帳號 ",
		"",
		"",
		""
		};


char *HoTextSelectMessage[12] = {
		"您確定要刪除這個角色嗎？",
		"開始遊戲",
		"您的角色數目已到上限，不能再創造新角色。",
		"角色設定完畢，是否確定？", 
		"請輸入角色的名字", 
		"這個名字已被使用，請重新輸入。", 
		"  請選擇角色  ", 
		" 請選擇種族 ", 
		"  請選擇職業  ", 
		"請選擇角色的造型", 
		"你無法刪除公會會長", 
		"贗楠 薑爾蒂 �挫恉瓞� 橈蝗棲棻" 
		};

char *HoTextTempscronInfo[5] = {
		" 坦普斯族：他們的祖先是古代在戰場上衝鋒陷陣的勇士，至今仍流傳著他們的傳說。他們在機械方面相當擅長，在商業上也很繁榮。坦普斯族有鬥士、武器專家、長槍兵、弓箭手等職業，全都能征善戰。他們身手敏捷，能熟練地使用各種武器。",

		" 能熟練操作各式攻擊性機械的唯一角色，懂得充分地應用機械武器的特性，但並不好戰。",
		" 擅長空手或使用近距離武器攻擊，在近距離戰鬥時能發揮強大的威力。肌肉發達，非常好戰。",
		" 能熟練地使用長矛和長槍，具有寬闊的視野和出色的觀察能力，在險惡的地形中也能穿梭自如。",
		" 擅長遠距離攻擊，主要使用弓箭類武器。體態輕盈、身手敏捷。"
		};



char *HoTextMoryon = "魔力恩";
char *HoTextMoryonInfo[5] = {
	"居住在精靈大陸的北部，信仰著名叫Pritos的神。他們以堅定的信念，誠實的性格，頑強地生活在精靈大陸。他們雖然是個性單純的種族，但也有多采多姿的文化，讓人好奇。精神修養跟身體鍛鍊都同樣受到他們的重視，發展出獨特的信仰與魔法，能夠自由使用他們的精神力量。",

    "帥氣威武的魔劍士擁有強大的精神力與體力，能運用神聖的力量攻擊敵人。在魔力恩的世界中是相當厲害的前鋒型角色。",
	"魔槍手擅用矛系武器，能將自己的武器與魔法結合而發揮強大的攻擊力。他們真正的力量在使用矛系武器時能全面發揮。結合魔法與長距離射程的攻擊，造就魔槍手獨特的魅力。",
	"從事聖職的祭司，透過長期的修養，始能被賦予神聖的力量，不但可以治療別人，還可以攻擊不友善的對手。相對於所擁有的強大神聖力量，在體質的表現上就不是那樣突出。",
	"魔法師是魔力的操弄者，能將魔法源轉換成實際的力量。他們長期研究大自然的元素，進而能夠自由地操控強大的力量，甚至可以影響大地跟星球的運轉。",
};

char *HoText_PartyMessage = "組隊邀請";

char *HoTextTempskron = "坦普斯";

char *HoTextFriendNear = "[最新目錄]";
char *HoTextFriendList = "[朋友目錄] %d/%d";
char *HoTextFriendRefuse = "[拒絕者目錄] %d/%d";
