
char *srMsg_001 = "동료장인 %s님께 %s님의 가입을 추천했습니다";
char *srMsg_002 = "%s님께 동료 신청을 했습니다";
char *srMsg_003 = "%s님은 동료입니다";
char *srMsg_004 = "%s님은 현재 다른 동료에 가입되어 있습니다";
char *srMsg_005 = "%s님은 현재 다른 동료에 가입되어 있습니다";
char *srMsg_006 = "레벨차이가 많아서 동료신청을 할수 없습니다";
char *srMsg_007 = "%s 님은 현재 접속중입니다";
char *srMsg_008 = "%s 님은 현재 접속중이 아니거나 찾을수 없습니다";
char *srMsg_009 = "아이템 %s를 생성했습니다";
char *srMsg_010 = "아이템 %s를 %s님께 보냈습니다";
char *srMsg_011 = "공지> %s";

char *srMsg_012 = "접속제한 인원을 %d명으로 설정 했습니다";
char *srMsg_013 = "현재 접속제한 인원은 %d명 입니다";
char *srMsg_014 = "%d번째 클라이언트 확인코드를 추가했습니다( %d )";
char *srMsg_015 = "코드를 추가할수 없습니다-FULL";
char *srMsg_016 = "클라이언트 확인을 해제했습니다";
char *srMsg_017 = "축하합니다. %s님을 짤랐습니다";
char *srMsg_018 = "%s 계정에 %s 캐릭을 연결했습니다";
char *srMsg_019 = "계정 연결에 실패했습니다";
char *srMsg_020 = "내상태(%d) ";
char *srMsg_021 = "동료장(%s) ";
char *srMsg_022 = "동료에서 탈퇴했습니다";
char *srMsg_023 = "%s님을 동료에서 추방했습니다";
char *srMsg_024 = "%s님은 동료가 아니거나 추방할수 없습니다";
char *srMsg_025 = "동료를 해산 시켰습니다";
char *srMsg_026 = "동료장을 %s님께 이임 했습니다";
char *srMsg_027 = "계정( %s ) 이름( %s ) IP( %s ) 접속시간( %d분 )";
char *srMsg_028 = "현재 접속중이 아니거나 찾을수 없습니다";
char *srMsg_029 = "계정( %s ) 이름( %s ) IP( %s ) 접속시간( %d분 )";
char *srMsg_030 = "현재 접속중이 아니거나 찾을수 없습니다";
char *srMsg_031 = "%s님의 위치 ( %s ) x=%d / z=%d ";
char *srMsg_032 = "접속인원 %d명 / 활동몬스터 %d개";
char *srMsg_033 = "열림 (%d) / 활성 (%d)";
char *srMsg_034 = "귓말을 보낼수 없습니다";
char *srMsg_035 = "귓말을 거부 합니다";
char *srMsg_036 = "귓말을 허용 합니다";
char *srMsg_037 = "> %s 님 %s 획득";
char *srMsg_038 = "> %s 님 기력약(신) 획득 [남은수:%d]";



char *srMsg_100 = "지금 SoD가 진행중이기 때문에 더이상 입장이 곤란합니다. 내일 일찍 다시 오시기 바랍니다.";
char *srMsg_101 = "아 죄송합니다. 당회 입장권은 모두 매진 되었습니다. 내일 새벽 일찍 다시 오시기 바랍니다.";
char *srMsg_102 = "SoD의 입장원을 판매 중입니다. 입장료는 레벨별로 받습니다";
char *srMsg_103 = "         %d 라운드           ";
char *srMsg_104 = "축하합니다. 상금 %d원을 획득했습니다";
char *srMsg_105 = "       점수 : %d           ";
char *srMsg_106 = "당회 입장권은 모두 매진 되었습니다";
char *srMsg_107 = "당신이 들어가기에는 너무 위험하니, 좀더 수련하고 오세요";
char *srMsg_108 = "지금은 입장 할수 없는 시간입니다. 나중에 다시오세요";
char *srMsg_110 = "당신의 팀은 탈락했습니다(%d위)  %d원을 획득했습니다";
char *srMsg_111 = "%s 몬스터를 물리 쳤습니다 ( %d점 획득 )";

char *srMsg_200 = "  소환할수 있는 갯수를 초과했습니다  ";
char *srMsg_201 = "   소환은 한 번씩만 할수 있습니다   ";
char *srMsg_202 = "   크리스탈을 사용할수 없습니다   ";

char *srMsg_300 = "     비밀번호(전화번호)가 틀리군요!    ";
char *srMsg_301 = "   연속으로 5회 이상 틀리면 사용할수 없습니다  ";

char *srMsg_400 = "      별 %d 개를 구입했습니다     ";
char *srMsg_401 = "       %d 원을 기부했습니다       "; 


char *srItem_BB = "복주머니";
char *srItem_PZ = "퍼즐";

#define CHAT_ANGERMONSTER_MAX		5
char *szAngerMonster[CHAT_ANGERMONSTER_MAX] = {
	"더 이상은 참을수 없다!",
	"종족의 복수다.",
	"우리를 괴롭히지 마라.",
	"비겁하구나! 참을수 없다",
	"우리를 괴롭히지 마라."
};


#define MORIF_CHAT_MAX		18
char *szMorifChatMsg[MORIF_CHAT_MAX] = {
	"나에게 맞아 쓰러지면 에이징 100% 성공시켜 주지!",
	"날 때리는 자에겐 에이징 실패의 저주가 ...",
	"비겁하구나! 참을수 없다",
	"가지고 있는 쉘텀 다 내놔..!",

	"지나친 에이징은 정신건강에 해로워~",
	"예비아이템을 준비한 후 에이징을 시도하면 좋을 텐데~",
	"에이징 실패 했다고 나 욕했지?",
	"에이징 저주를 받아라~",
	"가진 쉘텀 다 내놔~!",
	"+10차 에이징은 꿈도 꾸지마~",
	"두려워 말고 에이징을 해봐 흐흐흐",
	"너에겐 에이징 100%에 행운을 ~~~~~ 뻥이야 !",
	"어서 새로운 쉘텀을 구해야 몰리 할망구에게 혼나지 않을 텐데~",
	"너도 약하군~ 에이징으로 더욱 강하게 해줄까?",
	"이래 보여도 손님들이 날려버린 갑옷을 입고 있다고~! 날 우습게 보지마~!",
	"하하하~ 너한테 데비네는 안줄꺼야~",
	"나도 에이징 실패 시키고 싶지 않아~나도 피해자란 말야~",
	"또 걸렸네 ~ 그만 좀 뺏어가 ~ 나에겐 피 같은 쉘텀이야~"

};

#define MORIF_CHAT_DROP_MAX		15
char *szMorifChatDropMsg[MORIF_CHAT_DROP_MAX] = {
	"이걸 어떻게 모은건데..",
	"안돼~ 내꺼야..",
	"다음번 에이징할때 두고 보자!",

	"어떻게 모은 쉘텀인데~ 아~내 쉘텀",
	"안돼~ 쉘텀은 가져가지마~아~!",
	"나 때문에 에이징 실패하는거 아냐 머~ 아~ 진짜 억울해.",
	"이런다고 에이징이 성공할꺼 같아~? ",
	"아~ 에이징에 저주를......",
	"그래도 에이징 실패한 아이템은 내 창고에 있다 ~ 아싸~!",
	"으~ 다음에 또 보자~ 에이징 만세~!!",
	"흐흐흐~넌 이제 우리 가게 블랙리스트야~!",
	"크억~ 생명약을 갖고 왔어야 하는건데....",
	"니 얼굴 기억했어~! 필라이에서 다시 보자~!",
	"날 때리고도 용서 받길 바라니~? ",
	"넌 앞으로 믹스만 하는게 좋을걸~으흐흐~!"
};

#define MOLLYWOLF_CHAT_MAX		12
char *szMollyWolfChatMsg[MOLLYWOLF_CHAT_MAX] = {
	"너한테 햇밤 냄새가 나는데, 하나주면 안잡아먹지!",
	"햇밤 내놔라!",
	"훗! 감히 나, 햇밤훔친 늑대에게 도전하다니.",
	"너의 미라지도 내 것이다! 인벤토리를 조심해라.",
	"언젠간 너도 내 마음을 알꺼야. 햇밤이 먹고 싶었다고.",
	"내 햇밤 훔쳐가면 너랑 결혼할꺼야!!",
	"뭐야? 나랑 한번 해보자는 거야? 좋다 덤벼라~",
	"내가 햇밤으로 보이냐!!",
	"햇밤은 내가 다먹었다~",
	"햇밤 하나주면 안 잡아먹지~ 어흥~",
	"즐거운 한가위 되세요~",
	"우히히 속았지~ 내가 사람으로 보이냐~"
};


#define MOLLYWOLF_CHAT_DROP_MAX		13
char *szMollyWolfChatDropMsg[MOLLYWOLF_CHAT_DROP_MAX] = {
	"이미 다 상해 버렸어. 먹으면 배탈날껄?",
	"날 때리고도 추석을 잘 보낼 수 있을 것 같아?",
	"크어어어어어어억!",

	"이럴수가! 몇개 먹어보지도 못했는데.",
	"두고보자. 내년 추석엔 너한테 당하지 않겠어.",
	"너한테는 상한 햇밤의 저주가 내려질꺼야!",
	"나두 추석 때 햇밤이 먹구 싶었는데 ㅠ.ㅠ",
	"햇밤 혼자 먹으면 돼지 된다~ 파티원들과 나눠먹어~",
	"아이구~나죽네~~~암튼 추석 잘보내라구~",
	"윽....다음엔 순순히 당하지 않으리라.",
	"그래 너 잘났다. 햇밤 많이 묵고 배탈이나 나삐라.",
	"으~ 다음번엔 네 옷을 훔치겠어.",
	"흐흐~ 유통기한 지난 햇밤이나 먹어라."
};


#define SANTAGOBLIN_CHAT_MAX		17
char *szSantaGoblinChatMsg[SANTAGOBLIN_CHAT_MAX] = {
	"나를 열 받게 하지 마쇼! 점점 더 커질 수 있다고!",
	"나보다 못 생긴 여러분만 메리 크리스마스! 혹시 당신 예외라고 생각하는 거야?",
	"날 때리면 크리스마스 선물 안줄 꺼야.",
	"어이, 이봐. 당신~ 작년에도 솔로 아니었나?",
	"올해는 꼭 프앤을 만들어서 크리스마스를 프테와 함께 보내라고!",
	"1년에 겨우 한번 등장하는데 나오자마자 때리는 건 너무하지 않나?",
	"얼마 남지 않은 2005년을 잘 마무리하시길...",
	"나도 크리스마스 선물을 받고 싶다!!!",
	"루돌프는 내가 잡아 먹었지롱~",
	"불우한 이웃을 도웁시다!",
	"메리 크리스마스 !!! 기념으로 좀 맞아주면 안될까? 선물줄께!",
	"고블린이지만 산타는 산타라구! 이봐 나 산타 맞대니까?",
	"크리스마스 닭살 커플들에게 저주를!!!",
	"허리가 지끈거리는 게 이번 크리스마스에는 비가 올 것 같아",
	"날 때리면 나 닮은 딸 낳는다!!!",
	"왜 이렇게 말이 많냐구? 원래 그런 역할이야 후후!",
	"득템 하고 싶으면 불우한 이웃을 도우라구!!!"
};


#define SKILLMASTER_CHAT_MAX		16
char *szSkillMasterChatMsg[SKILLMASTER_CHAT_MAX] = {
	"제자라고 해서 사정 봐주지 않는다. 최선을 다해 보아라.",
	"좀 더 강하게 공격해 보란 말이다.",
	"이래서야 마물들과 대적할 수 있겠느냐? 좀 더 강하게 !!!",
	"너의 모든 능력을 동원해 나를 공격해 보아라!",
	"공격은 최선의 방어다! 짧고 강하게 나를 공격해 봐!",
	"템스크론의 정신을 잊지마라! 강인한 육체를 사용해 강력한 공격을 펼쳐봐!",
	"이래서야 퓨리에게 접근이나 하겠느냐!",
	"나를 이골라노스라 생각하고 죽을 힘을 다해 덤벼 봐!",
	"벌써 코어를 사용해 도망갈 생각을 하느냐?",
	"몬스터 크리스탈 따위는 이곳에서 소환되지 않으니 사용할 생각일랑 하지 말도록!",
	"혹시라도 북쪽의 필라이 타운에 갈일이 있거들랑 레이몬에게 안부나 전해주게.",
	"장비에 의존하지 말고 육체를 강인하게 단련해.",
	"방금 공격은 아주 좋았어! 계속 강력하게 공격을 해봐!",
	"처음 울버린 꼬리를 들고 왔을때와는 많이 달라졌구나!",
	"장비는 그렇게 좋으면서 공격력은 왜 이렇게 형편없는건가.",
	"방금 공격은 상당히 간지러웠어."
};

#define MAGICMASTER_CHAT_MAX		16
char *szMagicMasterChatMsg[MAGICMASTER_CHAT_MAX] = {
	"정신을 보다 집중해서 공격의 효율을 살려라!",
	"이래서야 엘리트 포인트를 살릴수 있겠느냐!",
	"스킬사용에 빈틈이 보이는군! 정신을 집중해!",
	"내가 이제껏 가르친 것들이 겨우 이정도냐?",
	"이번 공격은 상당히 좋았어! 좋아! 좋아!",
	"우리 모라이온의 기본은 신앙을 바탕으로하는 절제된 정신이다! 맑은 정신으로 공격에 집중해!",
	"이정도 공격으로 헬리온의 몸에 상처나 낼수 있겠느냐!",
	"벌써 코어를 사용해 도망갈 생각을 하느냐?",
	"몬스터 크리스탈 따위는 이곳에서 소환되지 않으니 사용할 생각일랑 하지 말도록!",
	"혹시라도 남쪽에 리카르텐타운에 갈일이 있거들랑 베르칸에게 안부나 전해주게.",
	"아무리 강한 몬스터라도 약점은 존재하는 법. 정신을 집중해서 효과적인 공격을 하게된다면 무었이 두렵겠느냐!",
	"매일 제자들과 대련을 하다 보니 이것도 상당히 피곤한걸.",
	"나를 이기고 배우는 스킬은 따로 숙련을 하지 않아도 돼.",
	"처음 스킬 포인트 하나를 들고 찾아왔을때와는 많이 다르구나.",
	"졸리는걸.",
	"나를 스승으로 생각한다면!!! 가만히 있게... ㅋㅋㅋ"
};



#define PAPACHICHEN_CHAT_MAX		7
char *szPaPaChichenChatMsg[PAPACHICHEN_CHAT_MAX] = {
	"올해도 어김없이 복날이 다가왔군..ㅠㅠ",
	"니가 우리 애기 때렸니?",
	"날카로운 부리로 널 쪼아주겠다!",
	"복날만 되면 이넘의 인기가 하늘로 치솟는군...",
	"파다닥~ 내 발차기 맛 좀 보시지~",
	"후라이드, 양념 치킨 중 어느 것을 좋아하지?",
	"뭐니뭐니해도 복날엔 삼계탕이 최고지!"
};


#define PAPACHICHEN_CHAT_DROP_MAX		5
char *szPaPaChichenChatDropMsg[PAPACHICHEN_CHAT_DROP_MAX] = {
	"이럴수가~ 내가 당하다니...",
	"날 때리고도 복날을 잘 보낼 수 있을 것 같아?",
	"크어어어어어어억!",
	"이럴수가! 너의 이름을 기억하고 있겠다",
	"두고보자. 다음 복날에는 너한테 당하지 않겠어."
};





char *szMonsterFlagMsg= "몬스터 출현지점(%d)[%d]";

#define		SERVER_DOWN_MSG_COUNT	5
char *szServerDownMsg[SERVER_DOWN_MSG_COUNT] = {
	"공지> 잠시 안내말씀 드리겠습니다",
	"공지> 서버점검 관계로 잠시후에 서버가 중지됩니다",
	"공지> 게임을 정상적으로 종료해 주시기 부탁드리겠습니다",
	"공지> 서버가 곧 다운될 예정입니다.",
	"공지> 게임을 종료해 주시면 감사합니다"
};

char *szSeverDownCountMsg = "서버다운> %d분 %d초 남았습니다. 게임을 종료하십시오";

char *srBlessCastle_LeagueMsg_01 = "잠시후에 블레스캐슬 공성전이 재 시작 됩니다. 참여할 분들은 준비해 주십시오"; 
char *srBlessCastle_LeagueMsg_02 = "지금 블레스캐슬 공성전이 시작 되었습니다. 참가하신 모든 분들의 행운을 기원합니다"; 
char *srBlessCastle_LeagueMsg_03 = "공성전이 종료되었습니다. 참가해주신 모든 분들께 감사드립니다"; 
char *srBlessCastle_LeagueMsg_04 = "지금부터 30분 후에 블레스캐슬 공성전이 시작됩니다. 참여할 분들은 준비해 주십시오"; 
char *srBlessCastle_LeagueMsg_05 = "지금부터 1시간 후에 블레스캐슬 공성전이 시작됩니다. 참여할 분들은 준비해 주십시오"; 

char *srMsg_StartUser_PresentItem = "    당신에게 아이템 %s 를 선물로 드리겠습니다   "; 

char *srMsg_ThanksPolling = "   설문에 참여해 주셔서 감사합니다    ";

char *szNotLinkCore = "유니온코어를 사용할수 없습니다";
char *szNotLinkCore2 = "  대상 클랜이 다릅니다  ";
char *szNotLinkCore3 = " 레벨제한으로 이동할수 없습니다 ";


char	*srMsg_Bl_01	= "사용 시간이 %d분 남았습니다";
char	*srMsg_Bl_02	= "[PC방]";
char	*srMsg_BI_03	= "추가 예약 [%d년 %d월 %d일] 입니다";
char	*srMsg_BI_04	= "추가 예약 [%d 시간] 입니다";

char	*srMsg_Bl_100	= "%s사용 종료일은  %d년 %d월 %d일 0시 0분 입니다.%s";
char	*srMsg_Bl_101	= "%s사용 종료시간까지  %d 시간 %d분 남았습니다.%s";
char	*srMsg_Bl_102	= "%s사용 종료시간까지 %d분 남았습니다.%s";






#define WORLDCUP_CHAT_MAX		16
char *szWorldCupChatMsg[WORLDCUP_CHAT_MAX]= {
	"한국은 우리의 첫승 제물이야!!",
	"비켜라. 한국 16강은 우리가 진출한다",
	"내가 골을 넣게 해주면 발렌토 링을 주겠다.",
	"나의 모든 힘을 실어.. 강슛~!!",

	"가서 좀 더 연습하고 오면 안되겠니~?",
	"토 나올 정도로 고통스럽게 해주마",
	"축구공의 매운 맛을 보여주마",
	"날 뚫고 지나갈 수 있을 거라고 생각하는 것이냐?",
	"2002 월드컵 4강에 진출한 것은 운이였다.",
	"내가 이렇게 무너지다니..",
	"발악을 하는구나.. 후후~!!",
	"크크.. 막을테면 막아 봐라~!!",
	"오! 딱걸렸어. 혼줄을 내줄 테다",
	"과연 너 따위가 나를 쓰러트릴 수 있을까..?",
	"흥!~ 16강 어림도 없는소리!! 받아랏~",
	"나의 현란한 드리볼을 막아봐라~!"
};


#define WORLDCUP_CHAT_DROP_MAX		14
char *szWorldCupChatDropMsg[WORLDCUP_CHAT_DROP_MAX] = {
	"읔...나를 꺾었다니...16강 진출이 희망적이군..",
	"읔..16강 진출을 축하한다.. ㅠㅠ",
	"쳇~! 강하군. 한국이 진출하겠구나…",

	"쿨럭~!! 4년후엔 반드시...",
	"역시 너희는 4강진출국! 붉은악마로군...!!",
	"이럴수가… 반드시 다시 돌아 온다.",
	"이것이 끝이 아니다.",
	"허헉.. 졌다.. 너희의 승리다...",
	"나 하나를 이겼다고 우쭐하지 마라~!!",
	"하..한번만 봐주세요.. 훌쩍..",
	"오~ 좀 쎈데..두고보자",
	"세대교체가 이루어 지지 않은 것이 한이구나.",
	"읔..측면 돌파에 내가 당하다니..",
	"윽 역시 대한민국은 모두 쎄구나, 월드컵에서 지는 것도 서러운데~ -.ㅜ"
};
