
char *srMsg_001 =  "ผู้นำ Party %s ได้เสนอให้ %s ร่วม Party "  ;
char *srMsg_002 =  "ส่งคำเชิญ Party ไปยัง %s "  ;
char *srMsg_003 =  "%s อยู่ใน Party ของท่านอยู่แล้ว "  ;
char *srMsg_004 =  "%s เป็นสมาชิก Party อื่น "  ;
char *srMsg_005 =  "%s เป็นสมาชิก Party อื่น "  ;
char *srMsg_006 =  "เลเวลต่างกันมากเกินไป "  ;
char *srMsg_007 =  "%s มีสถานะ online "  ;
char *srMsg_008 =  "%s ไม่ได้ online อยู่ หรือหาชื่อนี้ไม่พบ "  ;
char *srMsg_009 =  "%s ได้ถูกสร้างขึ้น "  ;
char *srMsg_010 =  "%s ได้ถูกส่งให้ %s "  ;
char *srMsg_011 =  "ประกาศ> %s "  ;
char *srMsg_012 =  "จำนวนสูงสุดของผู้เล่นใน Server กำหนดไว้ที่  %d คน "  ;
char *srMsg_013 =  "ปัจจุบันมีจำนวนผู้เล่นอยู่ใน Server  %d คน "  ;
char *srMsg_014 =  "Authorization code for client %d has been added ( %d ) "  ;
char *srMsg_015 =  "จำนวนผู้เล่นเกินกว่าที่กำหนด - เต็ม "  ;
char *srMsg_016 = "ยกเลิกการตรวจสอบ Client";
char *srMsg_017 =  "คุณตัด %s ออกจากเกม "  ;
char *srMsg_018 =  "%s มีตัวละครชื่อ %s อยู่แล้ว "  ;
char *srMsg_019 =  "ไม่สามารถเข้า Account นี้ได้ "  ;
char *srMsg_020 =  "สถานะของฉัน (%d) "  ;
char *srMsg_021 =  "ผู้นำ Party (%s) "  ;
char *srMsg_022 =  "คุณได้ออกจาก Party "  ;
char *srMsg_023 =  "%s ถูกปลดออกจาก Party "  ;
char *srMsg_024 =  "%s ไม่ใช่สมาชิกของ Party หรือไม่สามารถปลดออกได้ "  ;
char *srMsg_025 =  "Party ของคุณถูกยกเลิก "  ;
char *srMsg_026 =  "%s ได้รับแต่งตั้งเป็นผู้นำ Party "  ;
char *srMsg_027 =  "Account ( %s ) ชื่อ ( %s ) IP( %s ) ได้เชื่อมต่อกับระบบเป็นเวลา ( %d นาที )"  ;
char *srMsg_028 =  "ไม่ online ในขณะนี้ หรือ หาชื่อนี้ไม่พบ "  ;
char *srMsg_029 =  "Account ( %s ) ชื่อ ( %s ) IP( %s ) ได้เชื่อมต่อกับระบบเป็นเวลา ( %d นาที )"  ;
char *srMsg_030 =  "ไม่ได้ online อยู่ หรือไม่สามารถหาพบ "  ;
char *srMsg_031 =  "ตำแหน่งของ %s ( %s ) x=%d / z=%d "  ;
char *srMsg_032 =  "จำนวนผู้เล่น %d คน/ จำนวนมอนสเตอร์ %d ตัว "  ;
char *srMsg_033 =  "Open (%d) / Active (%d) "  ;
char *srMsg_034 =  "ไม่สามารถส่ง PM ได้ "  ;
char *srMsg_035 =  "PM ถูกปฏิเสธ "  ;
char *srMsg_036 =  "ไม่สามารถส่ง PM ได้ "  ;
char *srMsg_037 = "คุณ %s ได้  %s ";
char *srMsg_038 = "> %s ได้รับยาพลังปราณ(ใหม่) [จำนวนที่เหลือ:%d]";

char *srMsg_100 =  "ท่านไม่สามารถเข้าร่วมได้ในขณะนี้ เนื่องจากการแข่งขันได้เริ่มไปแล้ว ลองอีกรอบตอนรุ่งสางพรุ่งนี้ ";
char *srMsg_101 =  "ตั๋วหมดแล้วคร้าบ ตื่นเช้าๆหน่อยสิคร้าบ -_- "  ;
char *srMsg_102 =  "ยินดีต้อนรับสู่ สุดยอดอภิมหาการการแข่งขัน ท่านสามารถร่วมสนุกได้เพียงซื้อตั๋วกับข้า... ^^ "  ;
char *srMsg_103 =  "      รอบที่  %d           "  ;
char *srMsg_104 =  "ยินดีด้วยครับท่านผู้กล้าทั้งหลาย.. การแข่งขันได้จบลงแล้ว และท่านยังสามารถยืนหยัดอยู่ได้ (ได้รับ $ %d ) "  ;
char *srMsg_105 =  "     คะแนน : %d           "  ;
char *srMsg_106 =  "ตั๋วหมดแล้วคร้าบ ตื่นเช้าๆหน่อยสิคร้าบ -_- "  ;
char *srMsg_107 =  "โห..ท่าน.. อย่าเข้าไปเลย..ตายเปล่า ข้าว่าไปอัพเลเวลก่อนแล้วค่อยกลับมาดีกว่า "  ;
char *srMsg_108 =  "ท่านไม่สามารถเข้าร่วมการแข่งขันได้ตอนนี้เพราะว่าการแข่งขันได้เริ่มไปแล้ว "  ;
char *srMsg_110 = "แคลนของคุณตกอันดับ อยู่อันดับที่ (%dภง)  %d";
char *srMsg_111 = "%s กําจัดมอนสเตอร์ได้ ( %d คะแนน )";

char *srMsg_200 =  "ท่านไม่สามารถรวบรวม ได้เกินกว่าน ี้"  ;
char *srMsg_201 =  "ท่านสามารถรวบรวม ได้ครั้งละหนึ่งเท่านั้น "  ;
char *srMsg_202 = "    ใช้คริสตัลไม่ได้   ";

char *srMsg_300 =  "รหัสผ่านไม่ถูกต้อง "  ;
char *srMsg_301 =  "หากใส่รหัสผ่านผิดเกิน 5 ครั้งจะไม่สามารถเข้าสู่ระบบได้ "  ;

char *srMsg_400 =  " ได้รับ Star จำนวน %d อัน "  ;
char *srMsg_401 = "       ได้จ่ายเป็นจำนวนเงิน %d        "; 

char *srItem_BB = "ถุงนำโชค ";
char *srItem_PZ = " Puzzle ";

#define CHAT_ANGERMONSTER_MAX		5
char *szAngerMonster[CHAT_ANGERMONSTER_MAX] = {
	 "ข้าทนไม่ไหวแล้วโว้ยยยยย "  ,
	 "นี่คือการแก้แค้นของพวกเจ้าเรอะ "  ,
	 "พวกเจ้าจงหยุดการกระทำของพวกเจ้าซ่ะ "  ,
	 "มันไม่มากไปหน่อยรึ ที่จะปล่อยให้พวกเจ้าทำร้ายข้าอีก "  ,
	 "เจ้าพวกมดปลวก อย่าดูถูกพวกข้าไป  "  
};

#define MORIF_CHAT_MAX		18
char *szMorifChatMsg[MORIF_CHAT_MAX] = {
	"หากเจ้ายอมตายเพื่อข้า ข้าจะช่วยให้เจ้า Aging ได้สำเร็จ"",
	"แต่ถ้าเจ้าทำร้ายข้า เจ้าจะไม่มีวัน Aging ได้สำเร็จ"",
	"จะยืนลอยหน้าลอยตาอีกนานไหม ข้าชักรำคาญเจ้าแล้วนะ"",
	"ส่ง Sheltom ทั้งหมดมาให้ข้า..!",
	"หากเจ้า Aging มากเกินไป จะพาลให้ปวดกบาลเปล่าๆ ข้าว่า",
	"เอาไว้เจ้าเตรียมของที่จะ Aging พร้อมแล้ว ค่อยมาหาข้าดีกว่า"",
	"อะไรนะ เจ้าหาว่าข้ากระจอกรึ! เจ้าคิดว่าข้าไม่มีปัญญาทำให้เจ้าได้รึไง"",
	"ขอให้เจ้า ตีแตกเถอะ 555",
	"ส่ง Sheltom ทั้งหมดมาให้ข้า...!",
	"แล้วอย่าหวังว่าเจ้าจะ Aging +10 ได้สำเร็จนะ ตื่นๆ"",
	"หลอนแล้วละสิ อย่ากลัวไปหน่อยเลย",
	"เจ้าคิดว่าเจ้าจะ +10 ได้สำเร็จงั้นรึ ฝันไปก่อนเถอะ 555",
	"โอ้ว Moly Granny ยาหยีของข้า ",
	"เจ้าไก่อ่อน มานี่ ให้ข้าช่วย Aging ให้เจ้ามั้ย ",
	"ข้าจะบอกอะไรให้เจ้าฟัง ข้าน่ะใส่เกราะที่พวก High Level ยังไม่มีเลย ",
	"เอิ๊ก!! อะไรนะ! เจ้ายังไม่เคยเห็น Devine เลยรึ โถ่เจ้าไก่ยังไม่ได้แช่",
	"ความจริงข้าก็ไม่อยากให้เจ้าตีแตกหรอก เพราะข้าจะพลอยเสียชื่อไปด้วย",
	"เชอะ! อีกแล้วเรอะ เจ้านี่ตอแยข้าไม่เลิก ไม่ต้องมาขอ Sheltom ข้านะ "
};

#define MORIF_CHAT_DROP_MAX		15
char *szMorifChatDropMsg[MORIF_CHAT_DROP_MAX] = {
	"ข้าจะไปหาของนี้ได้ยังไง"",
	"อ้าาา ของรักของข้า",
	"ครั้งหน้า ข้าจะทำให้เจ้าใหม่",
	"ข้าจะไปหา Sheltom พวกนี้ได้ยังไง โอ้วของรักของข้า",
	"อย่า อย่าเอา Sheltom ของข้าไป อย่า ได้โปรด"",
	"ตีแตก นี่ไม่ใช่ความผิดของข้านะ โชคเจ้าไม่ดีเอง"",
	"เจ้าคิดว่าเจ้าจะ Aging สำเร็จรึ",
	"นั่นไง แตกอีกละสิ",
	"Sheltom ที่ตีแตกยังอยู่ในกระเป๋าข้านี่หว่า หุหุ",
	"เฮื้อๆ หวังว่าคงได้เจอเจ้าอีกนะ เฮื้อๆ",
	"ชื่อเจ้าติดอยู่ในบัญชีดำร้านข้าด้วยนี่",
	"กรำ ทำไมเจ้าไม่เอา Red Potion มาให้ข้าด้วยเล่า",
	"ข้าจำเจ้าได้ ข้าเคยเห็นเจ้าเดินโทงๆใน Pillai นี่ ",
	"ข้าไม่มีวันอภัยให้เจ้าหรอก",
	"ข้าว่า คราวหน้าเจ้าไปเอาดีทางผสมไอเทม ดีกว่านะ 555"
};

#define MOLLYWOLF_CHAT_MAX		28
char *szMollyWolfChatMsg[MOLLYWOLF_CHAT_MAX] = {
	"คุณคิดว่าฉันคือ Molly the Granny หรือไง?",
	"คุณมีกลิ่นไก่งวงนี่ เอาคืนมาให้ฉันซะดีๆ ไม่งั้น แกตาย!",
	"ไก่งวง จะช่วยฟื้นคืน HP ให้เพื่อนของคุณทั้งหมด",
	"ข้าล้วงมันมาจากเจ้าแล้วละ! ไม่เชื่อก็ลองดูใน Inventory เจ้าเอาเองละกัน ",
	"ข้าเอาไก่งวงมาจาก Molly the Granny, เจ้าอยากลองชิมมั้ยละ?",
	"เห๊อะ เหอ ๆ รู้สึกดีไงไม่รู้?",
	"Royal Jelly? ข้าจะกินให้เรียบเลย!",
	"วันนึง เจ้าคงจะเข้าใจความรู้สึกของข้า. ข้าแค่อยากกิน ...",
	"เจ้าถูก Molly the Granny หลอกแล้วละ! เธอนะแหละที่ฟาดเรียบ",
	"ข้าคือ Molly the Granny! อยากจะดูสิ่งที่อยู่ในมือข้าเหรอ?",
	"ชุดนี้มันดูดีกับข้าซะจริงๆ, huh? huhu",
	"ข้าคือ ลูกหมาป่า ของ Molly the Granny!",
	"เจ้าเอาไก่งวงของข้าไป, เจ้าต้องแต่งงานกับข้า ในข้อหาเสียผีแล้วละ!!",
	"HaHa เจ้าอยากจะตีบวก 10 เหรอ? ฟังดูเข้าท่านะ แต่...",
	"อะไรนะ? อยากต่อยกับข้านักใช่มั้ย? มาเลยดีกว่า!",
	"Huh? จงไปตามหาเจ้าหมูน้อยทั้ง 3 ไปซะแล้วเจ้าจะเห็นเอง...?",
	"ข้าคือลูกแกะในคราบหมาป่า",
	"Molly the Granny สั่งให้เจ้าทําหรือ?",
	"ข้าคือ Molly ตัวจริง เสียงจริง อีกคนที่เจ้าเจอในเมืองเป็นตัวปลอม ",
	"เก็บไก่งวงของเจ้าไว้เถอะ ส่งแค่ Royal Jelly มาให้ข้าก็พอ",
	"ข้าดูเหมือนไก่งวงนักเหรอไง!!",
	"ไก่ทั้งหมด ข้าฟาดเรียบแล้วล่ะ",
	"บัดนี้ไก่งวงได้ถูกข้าฟาดเรียบไปแล้ว ",
	"ส่งไก่งวงมาให้ข้าซะดีๆ ไม่อย่างนั้น เจ้าได้ตาย... แน่~ แฮ่ ",
	"Oo-hehe เจ้าโง่ คิดว่าข้าเป็นมนุษย์เหรอไง ",
	"Baby! ข้าจะดูแลไก่งวงนี่ให้แล้วกัน, แล้วมาสนุกกับข้าเถอะ! Baby~~!!"
};


#define MOLLYWOLF_CHAT_DROP_MAX		25
char *szMollyWolfChatDropMsg[MOLLYWOLF_CHAT_DROP_MAX] = {
	"มันเน่าแล้ว เจ้าได้ปวดท้องแน่งานนี้ ",
	"เจ้าคิดว่าเจ้าจะมีความสุขแน่เหรอ ในวันขอบคุณพระเจ้า หลังจากที่เจ้าฆ่าข้าไปแล้ว?",
	"เจ้าคิดว่าเจ้าจะมีความสุขแน่เหรอ ในวันขอบคุณพระเจ้า หลังจากที่เจ้าฆ่าข้าไปแล้ว?",
	"Khuhuhuhuhuk!",
	"โอ้วพระเจ้าจอร์จ! ข้าพึ่งกินไปไม่กี่ชิ้น"
	"ข้าไม่คิดจะให้ ไก่งวง กับ Royal Jelly แก่เจ้าหรอกนะ!",
	"ข้าไม่กลัวตายหรอก เพราะข้าได้ขโมยทุกสิ่งที่ข้าต้องการมาเป็นของข้าหมดแล้ว...",
	"ข้าจะไม่มีวันลืม...  -ฆฎ",
	"คราวหน้า ข้างับเจ้าแน่ คอยดูเถอะ เจ้าไม่มีวันจับข้าได้ง่ายๆหรอก",
	"ข้าไม่ใช่ Moriff pop!! ข้าไม่มี Sheltom หรือสิ่งที่ท่านต้องการหรอก!",
	"เจ้าตกอยู่ภายใต้คําสาปมรณะ!",
	"Ohhh..Molly ช่วยพยุงข้าที T.T",
	"ข้าอยากจะกินไก่งวงตัวโตๆ ในวันขอบคุณพระเจ้าซะจริงๆ T.T",
	"มันคือขนมโมจิ ที่ถูกขโมยไป",
	"เจ้าเป็นคนออกแบบชุดนี้เหรอ? T.T",
	"ข้าเกลียดแก, Molly~ T.T",
	"หากเจ้ากินคนเดียว เจ้าจะกลายเป็นหมูทันที..-_-+ ดังนั้นจงแบ่งปันให้เพื่อนในปาร์ตี้ของเจ้าซะ ",
	"รสชาตห่วยแตกมาก, เพราะ Molly เป็นคนทํา ",
	"Oops เจ้าจะฆ่าข้าจริงๆเหรอ, ถ้างั้นก็สุขสันต์วันขอบคุณพระเจ้าล่วงหน้าละกันนะ",
	"Ooh....เจ้าจะต้องชดใช้ในคราวหน้า ",
	"OK เจ้าเบิ้ม ช่วยเหลือตัวเองไปก่อนละกันนะ",
	"Ooh~  คราวหน้าข้าขโมยเสื้อเจ้าแน่ ",
	"Huhu~  นี่คือไก่ที่ขโมยมา",
	"Jesus! แจ้าขโมยไก่ของข้า!! เพื่อข้าจะสอนบทเรียนให้กับเจ้าเอง! ",
	"เจ้านั่นมันจะฆ่าข้า  ทั้งๆที่ข้าให้ไก่งวงไปแล้วนะ",
	"Oh... ข้าจะมอบนี้ให้กับเจ้า The Force"
};

#define SANTAGOBLIN_CHAT_MAX		18
char *szSantaGoblinChatMsg[SANTAGOBLIN_CHAT_MAX] = {
	"อย่ามากวนใจข้าได้มั้ย เดี๋ยวก็โดนดีหรอก ",
	"Merry Christmas ทุกคนที่หล่อน้อยกว่าข้า ?",
	"แน่จริงก็มาซี่ อย่ากวนให้มาก ไม่งั้นอดได้ของขวัญจากข้านะ ",
	"เจ้านี่ ปีที่แล้วยังฉายเดี่ยวอยู่เลยนี่ ?",
	"ปีนี้เจ้าต้องทําให้ได้ แล้วไปฉลองกับแฟนเจ้าเถอะ!",
	"ลุงซานตาร์ บอกว่าจะไปตีบวกซัก 8 รอบ ไม่ต้องตามไปดูก็รู้ แตกชัวร์",
	"ปีนึงมาแค่หนเดียว มาถึงก็ตีข้าเลย เดี๋ยวก็อดหรอก?",
	"ขอให้ปี 2548 ผ่านไปด้วยสิ่งที่ดีๆแล้วกัน ",
	"ข้าอยากได้ของขวัญคริสต์มาสเหมือนกันนะ !!!",
	"กวางรูดอล์ฟอ่ะเหรอ ข้าจับปิ้งกินไปเรียบร้อยแล้ว...",
	"ช่วยเหลือคนอนาถากันเถอะ!",
	"Merry Christmas ออกมาเจอกันหน่อย เพื่อความทรงจําที่ดี เดี๋ยวข้าเอาของขวัญให้",
	"Goblin จะเป็นซานตาร์มั้งไม่ได้เหรอไง ? ข้าบอกว่าข้าเป็นซานตาร์ ไม่เข้าใจเหรอไง?",
	"คริสต์มาสนี้ คู่ไหนหวานแหววมาละก็ ตาย!!!",
	"ปวดเอวแบบนี้สงสัยฝนตกฉลองคริสต์มาสแน่ ปีนี้ ",
	"ถ้ารังแกข้า ข้อขอให้เจ้าได้ลูกสาวหน้าตาเหมือนข้า!!!",
	"จะซักไปถึงไหนเนี่ย ข้าก็เป็นแบบนี้ของข้ามานานแล้วนะ!",
	"หากเจ้าอยากได้ไอเทม เจ้าต้องช่วยเหลือคนอนาถาก่อน !!!"
};



#define SKILLMASTER_CHAT_MAX		16
char *szSkillMasterChatMsg[SKILLMASTER_CHAT_MAX] = {
	"ไม่ต้องมาอ้างเลยว่าเป็นลูกศิษย์ข้า ข้าไม่ต่อให้หรอกนะ",
	"ไหนลองตีให้มันแรง กว่านี้หน่อยดิ๊ ",
	"อ่อนหัดแบบนี้ จะไปสู้กับมอนสเตอร์ยังไงไหว ให้มันเข้มแข็งหน่อยสิ !!!",
	"ฝีมือมีแค่ไหน งัดออกมาให้หมด!",
	"การโจมตีเป็นการป้องกันตัวที่ดีที่สุด ไหนลองตีข้าดูบ้างสิ!",
	"เจ้าอย่าลืมความเป็น Tempskron ละ จงใช้กายอันแข็งแกร่งของเจ้า!",
	"อ่อนหัดแบบนี้จะไปสู้กับพวก Pillai ได้!",
	"ขอให้เจ้าคิดว่า ข้าเป็นอีกอลลานอสแล้วเข้าโจมตีข้าให้สุดแรงเลย!",
	"อะไรกัน แค่นี้ก็คิดจะใช้คอร์หนีซะแล้วเหรอ?",
	"คิดจะใช้คริสตัลมอนสเตอร์ หรือไง อย่าเลยเสียของเปล่าๆ!",
	"หากเจ้ามีธุระไปแถวๆ Pillai ข้าฝากความคิดถึงไปยัง เรมอน ด้วยแล้วกัน ",
	"อย่าหวังพึ่งแต่อาวุธอย่างเดียว เจ้าต้องฝึกฝนร่างกายของเจ้าด้วย ",
	"ที่เจ้าโจมตีเมื่อกี้ดีมาก ลองทําแบบนั้นอีกทีสิ!",
	"เจ้าผิดกับสมัยแรกที่ถือหาง Wolverine เยอะเลย!",
	"อาวุธเจ้าก็ดีนี่นา แต่ทํามัยโจมตีไม่เป็นสับปะรดเลย ",
	"โจมตีข้าแล้วเหรอเนี่ย คันดีแท้"
};

#define MAGICMASTER_CHAT_MAX		16
char *szMagicMasterChatMsg[MAGICMASTER_CHAT_MAX] = {
	"ตั้งสมาธิให้ดีกว่านี้ แล้วเจ้าจะรุกได้ดีขึ้น!",
	"แค่เนี้ยนะ อย่าหวังเลยว่าจะได้!",
	"อย่าเปิดช่องระหว่างร่ายเวทย์สิ ตั้งสติหน่อย!",
	"เวร สอนแทบตาย ทําได้แค่นี้เองเหรอ?",
	"โอว! โจมตีแบบนี้สิจอร์จ มันถึงจะเยี่ยม",
	"พวกเราชาว Morion มีความเด็ดเดี่ยว ด้วยพลังแห่งศรัทธา เจ้าจงอย่าลืมซะละ ",
	"โจมตีแบบนี้ไม่ระคายผิดหรอกนะ!",
	"อะไรกัน แค่นี้ก็คิดจะใช้คอร์หนีซ่ะแล้วเหรอ?",
	"แถวนี้ใช้คริสตอลมอนสเตอร์ไม่ได้หรอกนะ ป่วยการป่าว!",
	"หากว่ามีธุระต้องไป Ricarten ฝากความคิดถึงเบร์คันด้วยละ",
	"ต่อให้มอนสเตอร์ร้ายขนาดไหนก็ตาม มันย่อมมีจุดอ่อน เจ้าต้องตั้งสมาธิให้ดีแล้วโจมตีให้แม่น!",
	"ข้าซ้อมมือกับลูกศิษย์ทุกวัน จนชักจะเหนื่อยแล้ว",
	"ทักษะที่ได้จากข้า เมื่อเรียนแล้วไม่ต้องไปฝึกเพิ่มเติมอีก",
	"เจ้าต่างกับสมัยแรกที่มีทักษะแค่ไม่กี่อย่าง เยอะมากทีเดียว",
	"อย่าตื่นเต้นมากนัก",
	"หากคิดว่าข้าเป็นอาจารย์ละก็ กลับบ้านไปเถอะ เหอ เหอ "
};

char *szMonsterFlagMsg=  "อันตราย! จุดเกิดมอนสเตอร์ "  ;

#define		SERVER_DOWN_MSG_COUNT	5
char *szServerDownMsg[SERVER_DOWN_MSG_COUNT] = {
	 "ประกาศ> สวัสดีค่ะ..ท่านนักรบทั้งหลาย... "  ,
	 "ประกาศ> ทางทีมงาน PT ขอปิด Server ชั่วขณะเพื่อทำการปรับปรุง "  ,
	 "ประกาศ> กรุณาออกจากเกม "  ,
	 "ประกาศ> Server จะถูกปิดในไม่ช้า "  ,
	 "ประกาศ> กรุณาออกจากเกม ขอบคุณค่ะ "  
};

char *szSeverDownCountMsg =  "ปิด Server> ภายใน %d นาที %d วินาที กรุณาออกจากเกม "  ;

char *srBlessCastle_LeagueMsg_01 = "อีกสักครู่ สงครามตีปราสาท Bless Castle จะเริ่มต้น ท่านที่จะเข้าร่วมกรุณาเตรียมตัว "; 
char *srBlessCastle_LeagueMsg_02 = "ขณะนี้สงครามตีปราสาท Bless Castle เริ่มแล้ว ขอให้ผู้เข้าร่วมทุกท่านโชคดี"; 
char *srBlessCastle_LeagueMsg_03 = "สงครามตีปราสาทจบแล้ว ขอบคุณทุกท่านที่เข้าร่วม "; 
char *srBlessCastle_LeagueMsg_04 = "อีกประมาณ 30 นาที สงครามตีปราสาท Bless Castle จะเริ่มขึ้น ขอให้ทุกท่านที่จะเข้าร่วมเตรียมตัว"; 
char *srBlessCastle_LeagueMsg_05 = "อีกประมาณ1ชั่วโมง สงครามตีปราสาท Bless Castle  จะเริ่มขึ้น ขอให้ทุกท่านที่จะเข้าร่วมเตรียมตัว"; 

char *srMsg_StartUser_PresentItem = "    ขอมอบไอเทม %s ให้เป็นของขวัญแก่ท่าน   ู   "; 

char *srMsg_ThanksPolling = "   ขอบคุณที่กรุณาตอบแบบสอบถาม   ";

char *szNotLinkCore =  "ไม่สามาถใช้ Union Core ได้ "  ;
char *szNotLinkCore2 =  "Clan ไม่ถูกต้อง "  ;
char *szNotLinkCore3 =  "เลเวลต่ำเกินไป"   ;


char	*srMsg_Bl_01	=  "เหลือเวลาอีก %d นาที "  ;
char	*srMsg_Bl_02	=  "[Internet Cafe] "  ;
char	*srMsg_BI_03	=  "ขณะนี้ [ปี%d  เดือน%d  วัน%d] "  ;
char	*srMsg_BI_04	=  "ขณะนี้ [%d ชั่วโมง] "  ;

char	*srMsg_Bl_100	= "%sYou can play until %d:%d - %d/%d/%d (GMT).%s";
char	*srMsg_Bl_1001	= "%sYou can play until %d:0%d - %d/%d/%d (GMT).%s";
char	*srMsg_Bl_101	=  "%s ท่านเหลือเวลาอีก %d ชั่วโมง %d นาที.%s "  ;
char	*srMsg_Bl_102	=  "%s ท่านเหลือเวลาอีก %d นาที %s "  ;

