#include "..\\HoBaram\\HoTextFile.h"

char *HoTextLoginMessage[20] =  {"      サーバーに接続中･･･    ",
				 "      サーバーに接続できません  ",
				 "   IDを再入力してください  ",
				 "パスワードを再入力してください",
				 "   サーバーに接続できません(1)　",
				 "   使用中のユーザーIDです  ",
				 "  バージョンが違います ",
				 "   サーバー接続者が多すぎます ",
				 "サーバーとの接続が切れました",
				 "  有効期限が終了しました",
				 "  有効期限が終了しました",
				 "  ユーザーIDの削除が申し込まれています ",
				 "サーバーが大変込み合っております。後程ご利用ください",
				"後程ご利用ください",
				"パスワードを3回以上間違いました。ホームページをご覧ください。",
				"パスワードに使用できない文字が含まれています。",
              "12歳未満の利用者はプリストンテールをご利用はできません",
              "プリストンテール利用規約に同意しないとゲームができません",
              "Return value is 7",
              "Return value is 9"
				};

char *HoTextSelectMessage[12] = { "キャラクターを削除しますか",
				  "ゲームをはじめます",
				   "キャラクターは5人までしか作れません",
				  "キャラクターが作成されました。設定を確認してください", 
				  "キャラクターの名前を入力してください", 
				  "このキャラクター名は使われています", 
				  "  キャラクターを選んでください  ", 
				  " 種族のマークをクリックしてください ", 
				  "  キャラクターを選んでください  ", 
				  "キャラクターの顔を選んでください", 
				  "クランチーフは削除できません", 
				  "クラン情報が確認できません" 
				};

char *HoTextTempscronInfo[5] = {" テムスクロン族は、戦闘力を高めつつ進化してきた種族。様々な武器を利用した多彩な技術を持ち、全種族の中で唯一機械を扱う強力な体力の持ち主でもある。",

                                " メカニシャンは、機械の取り扱いに優れたキャラクター。攻撃用の機械類を操る唯一のキャラクターでもある。",
								" ファイターは、接近戦のエキスパート。主に接近戦用の武器を使い、攻撃力が高い。",
								" パイクマンは、槍を主武器とするキャラクター。視野が広く、耐久力の高いスケールアーマーを好むのも特長のひとつ。",
								" アーチャーは、遠距離・射撃攻撃に優れたキャラクター。弓などの発射系武器を主に使用する。"};


char *HoTextMoryon = "モライオン";
char *HoTextMoryonInfo[5] = {
	"プリストン大陸の北部に住むモライオン族は、プリトスという神に仕えて宗教的に生きる温厚な種族。モライオン族は魔法文明が発達しており、戦士といっても「パワフル」より「テクニシャン」といえる戦い方を得意とする。また、全体的に明るく華麗な雰囲気が漂っている。",

    "ナイトは、モライオン族の敬虔な精神と強靭な肉体を併せ持つ戦士。ナイトの力は剣によって最大限に引き出され、戦士としての強い威厳も感じられる。また、中型アーマーを好んで装備する。",
	"アタランタは、モライオン族らしからぬ力強い印象を与える女性で、槍を使っての攻撃を得意とする。テムスクロン族の子孫だという噂もあるが、詳しいことはわかっていない。だが、服装からはモライオン族らしい雰囲気が漂っている。",
	"プリスティスは、純粋な神聖さを追い求め、常に人を助けて生きる信仰心のあつい女性。軽く裾の長い服装を好み、力のいらないオーブや杖を使用する。愛らしさと神秘的な雰囲気を併せ持つ。",
	"マジシャンは、精神力が非常に強く、強力な魔法を操る能力を持つ。プリスティスよりも力強いイメージがあり、攻撃的な魔法を使いこなす。裾の長い服に杖を持つ姿は魔法使いらしく、強い意志の力が感じられる。",
};

char *HoText_PartyMessage = "様からパーティーの申込";

char *HoTextTempskron = "テムスクロン";

char *HoTextFriendNear = "[リスト]";
char *HoTextFriendList = "[フレンドリスト] %d/%d        ";
char *HoTextFriendRefuse = "[拒否リスト] %d/%d        ";











