char *srMsg_001 = "パーティーリーダーの%s様に%s様の加入を推薦しました。";
char *srMsg_002 = "%s様にパーティーの申込をしました。";
char *srMsg_003 = "%s様はパーティーメンバーです。";
char *srMsg_004 = "%s様は現在他のパーティーに参加しています";
char *srMsg_005 = "%s様は現在他のパーティーに参加しています";
char *srMsg_006 = "レベル差が大きいため、パーティーに申込できません。";
char *srMsg_007 = "%s様は現在接続しています。";
char *srMsg_008 = "%s様は接続していないか検索できません。";
char *srMsg_009 = "アイテム%sを作成しました。";
char *srMsg_010 = "アイテム%sを%s様に送りました。";
char *srMsg_011 = "GM> %s";

char *srMsg_012 = "接続制限人数を%d人に設定しました。";
char *srMsg_013 = "現在の接続制限人数は%d人です。";
char *srMsg_014 = "%d番目のクライアント確認コードを追加しました( %d )";
char *srMsg_015 = "コードを追加することができません。-FULL";
char *srMsg_016 = "クライアント確認を解除しました。";
char *srMsg_017 = "%s様との接続を切断しました。";
char *srMsg_018 = "ユーザーID%sに%sキャラクターを連結しました。";
char *srMsg_019 = "ユーザーIDの連結に失敗しました。";
char *srMsg_020 = "自キャラクターの状態(%d)";
char *srMsg_021 = "パーティーリーダー(%s)";
char *srMsg_022 = "パーティーから脱退しました。";
char *srMsg_023 = "%s様をパーティーから追放しました。";
char *srMsg_024 = "%s様はパーティーメンバーではないか追放できません。";
char *srMsg_025 = "パーティーを解散しました。";
char *srMsg_026 = "パーティーリーダーを%s様に委任しました。";
char *srMsg_027 = "ユーザーID( %s )名前( %s ) IP( %s ) 接続時間( %d分 )";
char *srMsg_028 = "現在接続していないか検索できません。";
char *srMsg_029 = "ユーザーID( %s )名前( %s ) IP( %s ) 接続時間( %d分 )";
char *srMsg_030 = "現在接続していないか検索できません。";
char *srMsg_031 = "%s様の位置 ( %s ) x=%d / z=%d";
char *srMsg_032 = "接続人数%d人 / 活動モンスター%d体";
char *srMsg_033 = "開く(%d) / 活性(%d)";
char *srMsg_034 = "プライベートチャットを送ることができません。";
char *srMsg_035 = "プライベートチャットを拒否します。";
char *srMsg_036 = "プライベートチャットを許可します。";
char *srMsg_037 = "> %s 様 %s 獲得";
char *srMsg_038 = "> %s 様 気力薬（新） 獲得 [残り：%d]";

char *srMsg_100 = "ただ今イベント中につき入場できません。明日もう一度お越しください。";
char *srMsg_101 = "申し訳ございません。今回の入場券は売り切れました。明日もう一度お越しください。";
char *srMsg_102 = "無差別モンスターバトルの入場券を販売しています。見学は無料です。";
char *srMsg_103 = "         %d ラウンド          ";
char *srMsg_104 = "ありがとうございました。イベントが終了しました。(点数 %d 獲得)";
char *srMsg_105 = "       点数: %d           ";
char *srMsg_106 = "当イベントの入場券は売り切れました。";
char *srMsg_107 = "今のレベルでは、参加に危険が伴います。今しばらく修行を続けてください。";
char *srMsg_108 = "今は入場できない時間です。後ほどまたお越しください。";
char *srMsg_110 = "あなたのチームは脱落です(%d位)  %dGを獲得しました";
char *srMsg_111 = "%s モンスターを倒しました ( %d点獲得 )";

char *srMsg_200 = "  呼び出しできる個数を超過しました。  ";
char *srMsg_201 = "  呼び出しは一回しかできません。   ";
char *srMsg_202 = "   クリスタルを使用できません。   ";

char *srMsg_300 = "     暗証番号（電話番号）が違います!   ";
char *srMsg_301 = "   連続で５回以上間違うと使用できません。  ";

char *srMsg_400 = "       星 %d 個を購入しました。    ";
char *srMsg_401 = "       %d Gを寄付しました       "; 

char *srItem_BB = "福袋";
char *srItem_PZ = "パズル";

#define CHAT_ANGERMONSTER_MAX		5
char *szAngerMonster[CHAT_ANGERMONSTER_MAX] = {
	"もう我慢の限界だ!",
	"俺たち種族の復讐だ。 ",
	"これ以上ちょっかいを出すな！",
	"卑怯者! やっちまえ!",
	"いい加減にしろ！"
};

#define MORIF_CHAT_MAX		18
char *szMorifChatMsg[MORIF_CHAT_MAX] = {
	"前回はよくもやってくれたな！鬼神モリプ参上！",
	"われは鬼神モリプ！神石をいじめる愚民どもよ！覚悟！",
	"ポン呪ーーーーース！！！",
	"我輩の正体、分かるかな？モリプ？誰、それ。すごく良い名前だね。",

	"実はバックミラーついてます。はい。",
	"みかんの香りが…ポッ。もうエイジングなんかどうでもいいや…",
	"このみかん野郎どもが！（意味不明）",
	"みかんに代わっておしおきよぉん",
	"ゴールデンドリルみかん汁アターーーック！",
	"我こそはみかんを世界に広める為に舞い降りた正義の戦士！",
	"私が被ってる箱…実はエイジング＋１０。いやーお客さんの神石があるから楽だねー",
	"みかんから生まれたみかん太郎～。",
	"この面を見たものは…必ず…しかも現実で…むふふふふ",
	"冥府魔道超絶美形六道皇子酒呑茨木デラックススーパ童子モリプ！参上！",
	"今回は全装備お客さんが失敗したものを着てるんだよ!あははははは!",
	"ミスティック・クリスタル・パワ～",
	"バベル様にもらった新たな闇の力を見よ！",
	"貴様の神石はバベル様に全部プレゼントしたよ！はははは！給料上がったよ！"

};

#define MORIF_CHAT_DROP_MAX		15
char *szMorifChatDropMsg[MORIF_CHAT_DROP_MAX] = {
	"おぼえてろ～！",
	"バベル様～助けて～",
	"監督…暑いよ…前見えないよ…",

	"ふっ…。真っ白に燃え尽きたぜ…",
	"メラヒ君…空はなぜ…青いのかな…",
	"コタツさえあったら…お前なんかに…くっ",
	"ニューター、お前もいつかは…",
	"これで終わったと思うなよ！",
	"ごめんね。マリちゃん、アンナちゃん、シーズちゃん…（後略)",
	"駄目駄目エイジングばんざーい!!",
	"強いな…お前は…でも、エイジングはさせないよ…",
	"うっぷ。みかん食べすぎ…",
	"みかんをストーブの上で温めて食べたことある？",
	"強くなったな…お父さんは…うれしいよ…",
	"ミッドガルドよ永遠にー！"
};

char *szMiniMorif = "ミニモリプ";
char *szWantedMorif = "ブラックモリプ";

char *szMonsterFlagMsg= "危険!モンスター出没地帯";

#define		SERVER_DOWN_MSG_COUNT	5
char *szServerDownMsg[SERVER_DOWN_MSG_COUNT] = {
	"お知らせ> お知らせ致します。",
	"お知らせ> サーバー点検のため、まもなくサーバーが停止します。",
	"お知らせ> ゲームを終了してくださいますよう、お願い申し上げます。",
	"お知らせ> ただ今より、サーバーをダウンします。",
	"お知らせ> ゲームを終了してください。"
};

#define MOLLYWOLF_CHAT_MAX		28
char *szMollyWolfChatMsg[MOLLYWOLF_CHAT_MAX] = {
 	"私がまだモリおばあさんに見える･･･？",
 	"お前から栗のにおいがするな、1個よこさないとお前を食べちゃうぞ！",
 	"栗を使うとパーティー全員の体力が回復するぜ",
 	"ふっ。この俺様、栗取り狼に挑戦するとは･･･身の程知らずめ！",
 	"お前のデビネも盗んでやるぜ！インベントリに気をつけな。",
 	"モリおばあさんの栗は俺がもらった、お前にも分けてやろうか？",
	"モリおばあさんの服を着たらちょっと強くなった感じ？",
	"ろいやるぜりーが入ってるって？俺が全部食べちゃうぜ！",
	"いつかはお前にも分かるだろう･･･栗が食べたかった･･･・ ",
	"お前モリおばあさんにだまされたな！栗はモリおばあさんが全部食っちまったぜ！"
	"私がモリおばあさんよ～！手を見せて欲しいかい？",
	"この服似合うだろ？くっくっく",
	"俺はモリおばあさんのペット狼だぜ！",
	"俺の栗を盗んでみろ！お前と結婚してやる！！",
	"ぷはは！どうだ？エイジング＋10栗の味は！",
	"はあ？俺に喧嘩売ってんの？いいぜ！かかってきな！",
	"あん？子豚三兄弟はどこに･･･なんだ？お前は？",
	"ぼく、狼の皮をかぶった羊でちゅ。",
	"モリおばはんの差し金かい？もしかしてフォースじじいが？",
	"私が本物のモリおばあさんよ。町の私は偽者よ。",
	"栗在庫切れでーす。ろいやるぜりー持ってきてね～！！",
	"俺様が栗に見えるんかい！！",
	"栗は全部俺の腹の中だぜ！",
	"俺の中に栗があるぜ！",
	"栗一つよこさないと食っちまうぞ！がるるるー",
	"モリおばあさんでーす。皆元気でね～",
	"うっしし～俺が人間に見える？",
	"ヘイ！ベイビ！一緒に栗でもどお？ベイベ～！！"
};


#define MOLLYWOLF_CHAT_DROP_MAX		25
char *szMollyWolfChatDropMsg[MOLLYWOLF_CHAT_DROP_MAX] = {
	"もう腐っちまったぜ。食べるとおなか壊すぞ。",
	"俺を殴っててめえは幸せになれると思うのか？",
	"ぐああああああっ！",
	"そんなあ！まだ3個しか食べてねええ！",
	"栗はぜってぇあげねえ！",
	"もう死んでもいいぜ･･･思いっきり盗んだからな･･･ ", 	"覚えてろ！ ",
	"覚えてろよ･･･来年は負けないぞ！",
	"俺はモリフ野郎じゃないぜ！神石なんか持ってねぇ！",
	"お前に腐った栗の呪いがあらんことを！",
	"うっ･･･モリおばあさんがいじめる･･･しくしく ",
	"俺も栗食べたかったな･･･しくしく・",
	"俺が盗んだのは餃子だぜい！栗じゃねぇ！",
	"お前もこのコスチュームが欲しいんかい？",
	"モリおばあさんひどいよ～",
	"栗一人占めすると太るぞ･･･－－+ パーティーメンバーで分けて食べなー",
	"モリおばあさんの栗だからな･･･まずいぜ。",
 	"うおおお～死ぬ～とにかく元気でな～ううう～",
	"くっ･･･次は今回のようには行かないぞ！",
	"けっ。何様のつもりだ。栗食って食あたりにでもなりやがれ！",
	"うう～次はお前の服を盗んでやる。",
	"くっくっ。賞味期限切れの栗を食らえ。",
	"なんと！俺様の栗を盗むとは！！俺の友達が無事に帰さないぞ！",
	"ちくしょ～栗あげたのに～死ぬ～",
	"ううう･･･フォースはちゃんとお金払って買ったもんなのに･･･・"
};

#define SANTAGOBLIN_CHAT_MAX		18
char *szSantaGoblinChatMsg[SANTAGOBLIN_CHAT_MAX] = {
	"我輩を怒らせるな！もっともっと大きくなるぞ！",
	"我輩より不細工な皆にだけメリークリスマス！まさか、あんたは　違うと思ってるんかい？",
	"我輩を殴るとクリスマスプレゼントはないぞ。",
	"おーい、そこのあんた。昨年もシングルだったろ?",
	"今年は必ずプリ恋人を作ってクリスマスをプリとすごしなさいよ!",
	"サンタの爺はエイジング+8しに行ったよ。どうせ失敗するんだろ",
	"１年に一回しか登場できんのに出てくるそばで殴るのはひどくないか?",
	"残り少ない2005年を上手く過ごすように...",
	"我輩もクリスマスプレゼント欲しい!!!",
	"ルドルプは我輩が食べた~",
	"貧しい隣人を助けましょう!",
	"メリークリスマス!!! せっかくだからちょっと殴らせてくれない? 何かやるから!",
	"ゴブリンだけどサンタだぞ! おい? サンタだってば!",
	"クリスマスいちゃいちゃカップルに呪いを!!!",
	"今年のクリスマスは雨かな…腰が痛むのう…",
	"我輩を殴ると娘の顔、我輩に似るぞ!!!",
	"なんでそんなにうるさいかって？元々そういう役なんだ。ふふ!",
	"アイテム得たかったらボランティア活動の一つでもしな!!!"
};



#define SKILLMASTER_CHAT_MAX		16
char *szSkillMasterChatMsg[SKILLMASTER_CHAT_MAX] = {
	"弟子だとして手加減しないぞ。全力を尽くして見ろ。",
	"もっと強く来い!",
	"そんな力で魔物と戦えるか! もっと集中しろ!!!",
	"お前の全力で私を攻撃して見ろ!",
	"攻撃は最善の防御なり! 短く! 強く! かかって来い!",
	"テムスクロンの精神を忘れるな! 強靭な肉体を活かした強力な攻撃だ!",
	"それではフューリーに近づきすらできんぞ!",
	"私をイゴラノスと思って死力を尽くせ!",
	"もうコアを使って逃げようとするのか?",
	"モンスタークリスタルなんかはここでは使えないから、使うつもりだったなら諦めるんだな!",
	"もし北のピーライに行くことがあったらレイモンによろしく伝えてくれ。",
	"装備に頼らないで己の肉体を鍛えるんだ。",
	"今の攻撃は良かった! 続けて強力な攻撃を繰り出して見よ!",
	"昔、ウルバリンの尻尾を持ってきた時に比べると見違えたな!",
	"装備は立派なのに、なんだ? 今の攻撃は!",
	"今の攻撃は相当痒かったな。"
};

#define MAGICMASTER_CHAT_MAX		16
char *szMagicMasterChatMsg[MAGICMASTER_CHAT_MAX] = {
	"精神をもっと集中して攻撃の効率を上げろ!",
	"これではエリートポイントを生かせないぞ!",
	"スキルの使い方がすきだらけだ! 集中しろ!",
	"私が今まで教えたのはどこにやった? 何を学んだ!",
	"今回の攻撃は良かった! 良し! ",
	"我がモライオンの基本は信仰を元にする節制された精神だ! 精神を研ぎ澄ませ!",
	"これぐらいの攻撃でヘリオンの体に傷一つつけられるか!",
	"もうコアを使って逃げようとするのか??",
	"モンスタークリスタルなんかはここでは使えないから、使うつもりだったなら諦めるんだな!",
	"もし南のリカルデンタウンに行くことがあったらベルカンによろしく伝えてくれ。",
	"どんなに強いモンスターでも弱点は必ずあるもの。集中して効果的な攻撃をするなら恐れることはない!",
	"毎日弟子と組み手だから…結構疲れるな。",
	"私に勝って身につけたスキルは別に熟練させなくても良い。",
	"昔、スキルポイント一つ持ってきた時とはえらく違うのう。",
	"眠いな。",
	"私を師と思うのなら!!! 来るな... ふふふ"
};


#define PAPACHICHEN_CHAT_MAX		7
char *szPaPaChichenChatMsg[PAPACHICHEN_CHAT_MAX] = {
	"涼しくなってきたな。いっぱい食べないと！",
	"お前がうちの子を殴ったのか？",
	"鋭利なくちばしでお前をつついてやる！",
	"涼しくなるとなぜか仲間が減ってしまうんだ…",
	"バタバタ～私のキックの味わってみろ～",
	"フライドチキンと味付けチキンどっちがいい？",
	"なんといってもこれからは水炊きが最高！"
};


#define PAPACHICHEN_CHAT_DROP_MAX		5
char *szPaPaChichenChatDropMsg[PAPACHICHEN_CHAT_DROP_MAX] = {
	"信じられない～私がやられるなんて。。",
	"私を殴っても心は痛まないの？",
	"クオオオオオオ！",
	"信じられない！お前の名前を覚えてやる。",
	"次にはお前にやられない。きっとだぞ！"
};


char *szSeverDownCountMsg = "サーバーダウン> %d分 %d秒前です。ゲームを終了してください。";

char *srBlessCastle_LeagueMsg_01 = "後程ブレスキャッスル功城戦が再度行われます。参加される方は準備してください。"; 
char *srBlessCastle_LeagueMsg_02 = "只今、ブレスキャッスルの功城戦が始まりました。参加された皆様頑張ってください。"; 
char *srBlessCastle_LeagueMsg_03 = "功城戦が終了されました。ご参加頂いた皆様、有難うございました。"; 
char *srBlessCastle_LeagueMsg_04 = "只今から30分後、ブレスキャッスル功城戦が始まります。参加される方は準備してください。"; 
char *srBlessCastle_LeagueMsg_05 = "只今から1時間後、ブレスキャッスル功城戦が始まります。参加される方は準備してください。"; 

char *srMsg_StartUser_PresentItem = "    あなたにアイテム %s をプレゼントします。   "; 

char *srMsg_ThanksPolling = "   ご協力有難うございました。    ";


char *szNotLinkCore = "ユニオンコアが使えません。";
char *szNotLinkCore2 = "  対象クランが違います。  ";
char *szNotLinkCore3 = " レベル制限により移動できません。 ";


char	*srMsg_Bl_01	= "使用時間が %d分残っています。";
char	*srMsg_Bl_02	= "[ネットカフェ]";
char	*srMsg_BI_03	= "追加予約[%d年%d月%d日]です。";
char	*srMsg_BI_04	= "追加予約[%d時間]です。";

char	*srMsg_Bl_100	= "%s使用終了日は%d年%d月%d日0時0分です。%s";
char	*srMsg_Bl_101	= "%s使用終了時間まで%d時間%d分残っています。%s";
char	*srMsg_Bl_102	= "%s使用終了時間まで%d分残っています。%s";



char *szMon_FireCrystal = "ファイアクリスタル";  
char *szMon_LightningCrystal = "ライトニングクリスタル";
char *szMon_IceCrystal = "アイスクリスタル";
char *szMon_TowerCrystal = "タワークリスタル";
char *szMon_Castledoor = "城門";

char *szMon_Curse_Soldier_A = "呪われた民兵";
char *szMon_Curse_Soldier_B = "呪われた警備兵";
char *szMon_Curse_Soldier_C = "呪われた守護兵";
char *szMon_Castledoor_Soldier = "城門守護兵";

char *szEvent_HopeMsg_StateInit = "レッドストーンの再配布をお願いします。";
char *StateInitEvent1 = "クリス：用意したレッドストーンは全て交換されてしまった。";
char *StateInitEvent2 = "クリス：君はもう貰ってる。もっと欲しければアイテムショップに行ってみなさい。";
char *StateInitEvent3 = "レッドストーン";
char *StateInitEvent4 = "クリス：リカルテンは素晴らしい町でしょ？アイテム配給所にアイテムを送りましたよ！";
