char *srMsg_001 = "尊敬的 %s 队长，我推荐 %s 加入您的队伍。";
char *srMsg_002 = "你已经申请加入 %s 的队伍。";
char *srMsg_003 = "%s 已经是你的队友。";
char *srMsg_004 = "%s 已经加入了其他队伍。";
char *srMsg_005 = "%s 已经加入了别人的队伍。";
char *srMsg_006 = "双方的等级差别太大，不能组成队伍。";
char *srMsg_007 = "%s 已经上线。";
char *srMsg_008 = "%s 没有上线或找不到。";
char *srMsg_009 = "你打造出了%s。";
char *srMsg_010 = "你把 %s 送给了 %s。";
char *srMsg_011 = "公告: %s";

char *srMsg_012 = "最大连接数已设为: %d";
char *srMsg_013 = "当前最大连接数为: %d";
char *srMsg_014 = "你添加了第 %d 个客户端(CLIENT)确认CODE ( %d )";
char *srMsg_015 = "客户端(CLIENT)确认CODE已满(FULL)，不能再加。";
char *srMsg_016 = "客户端(CLIENT)确认已解除。";
char *srMsg_017 = "恭喜，%s 已被踢出游戏(Kickout)";
char *srMsg_018 = "帐号(%s)的角色(%s)已连接。";
char *srMsg_019 = "帐号连接失败。";
char *srMsg_020 = "状态(%d) ";
char *srMsg_021 = "队长(%s) ";
char *srMsg_022 = "你已经离开了队伍。";
char *srMsg_023 = "%s 已被踢出队伍。";
char *srMsg_024 = "%s 不是你的队友，无法踢出队伍。";
char *srMsg_025 = "队伍解散了。";
char *srMsg_026 = "%s 被任命为队长。";
char *srMsg_027 = "帐号( %s ) 名字( %s ) IP( %s ) 连线时间( %d分钟 )";
char *srMsg_028 = "没有上线，或者无法找到";
char *srMsg_029 = "帐号( %s ) 名字( %s ) IP( %s ) 连线时间( %d分钟 )";
char *srMsg_030 = "没有上线或无法找到";
char *srMsg_031 = "%s 的位置: ( %s ) x=%d / z=%d ";
char *srMsg_032 = "在线人数 = %d / 活动的怪物 = %d";
char *srMsg_033 = "Open (%d) / Active (%d)";
char *srMsg_034 = "无法发送私聊信息";
char *srMsg_035 = "拒绝私聊";
char *srMsg_036 = "允许私聊";
char *srMsg_037 = "> %s 获得 %s";
char *srMsg_038 = "> %s 获得神秘的力量[剩余:%d]";


char *srMsg_100 = "因为现在正进行活动所以不可能在加入了.希望明天早点再连线";
char *srMsg_101 = "非常抱歉，目前门票已经全部售完。希望明天早点再连线.";
char *srMsg_102 = "正在销售最高等级无差别怪兽活动的入场券.入场券只售10万元.^^";
char *srMsg_103 = "         %d 回合           ";
char *srMsg_104 = "祝贺吧 活动已经结束了(获得赏金 %d )";
char *srMsg_105 = "       分数 : %d           ";
char *srMsg_106 = "目前入场券已经全部售完";
char *srMsg_107 = "您如果进入这里会很危险，希望您再锻炼一下再来";
char *srMsg_108 = "现在无法进入,请过一段时间再来";
char *srMsg_110 = "你的团队离开(no.%d) 增加了%dGold";
char *srMsg_111 = "%s 击败一个怪物 ( 增加了 %点 )";

char *srMsg_200 = "  已经超过了可召唤的数量  ";
char *srMsg_201 = "   每次只能召唤一次   ";
char *srMsg_202 = "   你不能够使用这水晶   ";

char *srMsg_300 = "     输入的密码（电话号码）不正确!";
char *srMsg_301 = "   连续五次输入错误，将无法再使用";

char *srMsg_400 = "      购买了%d颗星星    ";
char *srMsg_401 = "      捐赠 %d        "; 

char *srItem_BB = "幸运的袋子";
char *srItem_PZ = "难题";

#define CHAT_ANGERMONSTER_MAX		5
char *szAngerMonster[CHAT_ANGERMONSTER_MAX] = {
	"我无法再忍受了!",
	"这就是我们族的复仇力量.",
	"请不要再折磨我们了.",
	"卑鄙的小人! 无法再忍受了!",
	"请不要再折磨我们了."
};

#define MORIF_CHAT_MAX		18
char *szMorifChatMsg[MORIF_CHAT_MAX] = {
"为我死, 而且成功老化 .",
	"如果你打倒我,你将会得到考试不及格的诅咒T_T",
	"你是一个懦弱的人! 我不能忍耐",
	"对我使用你所有的技能吧!",

	"尝试太多老方法而且时常失败使你逊色 ~",
	"在你把它战胜之前，预先准备好方法是好滴 ~",
	"你会说什么会使你失败 ?",
	"这是我的老化诅咒 ~",
	"给我你的所有宝石 ~!",
	" 甚至不想 +10 岁 ~",
	"不要因为老化而害怕。 呼呼",
	"你将会成功 100% 的老化~~~~~ 哄骗嘿嘿 !",
	"我 好害怕 ~",
	"你也是弱的 ~ 我能想办法使你强壮吗 ?",
	"你知道我正在戴的盔甲是一个战士因失败而被我缴获滴~! 嘿嘿，强吧~!",
	"嘿嘿嘿 ~ 你不再拿 ~",
	"我不想要你失败而颓废 ~~",
	"嗨! ~ ~ 每件东东都是我的宝物~"
};

#define MORIF_CHAT_DROP_MAX		15
char *szMorifChatDropMsg[MORIF_CHAT_DROP_MAX] = {
	"我如何拿这些。。",
	"我的天那! 它是我的。",
	" 下次 , 你将会得到我的报复 !",

	" 我的宝石~ 哦 ~ 我的宝石~555！~",
	"NOOOOO! 不要戴我的 宝石~哦~!MY GOD！",
	"老是失败但不是我的过失 ~啊啊~ 真的不公平 .",
	" 你认为在你成功之后，会~?嘿嘿 ",
	"啊啊~ 老化诅咒......",
	"在我的脑海里的你已经失败 ~ 哈哈 ~!",
	"啊~ 我下次将打倒你 ~胜利~!!",
	"呼呼~ 你将在我商店的黑名单出现，嘎嘎 !",
	"晕~ 我应该要有较多的生命的....",
	"我记得你~! 你将会在 菲尔拉 支付这些~!",
	"我永远不再原谅你 ~",
	"你未来最好做唯一的合成 ~ 哼 ~!"
};

#define MOLLYWOLF_CHAT_MAX		28
char *szMollyWolfChatMsg[MOLLYWOLF_CHAT_MAX] = {
" 你仍然认为我是精灵鼠小弟 ?",
	"你火鸡的味道, 给我一块它 , 和我将不杀你 !",
	"火鸡将会复原你所有朋友的生命.",
	"嘿! 你如何向我挑战, 带了火鸡的狼!。",
	"我将会也取走你的 虎翼! 看看你的物品栏。",
	"我是那一个带了来自菲尔拉的宝石的精灵鼠, 你想要吗一些?",
	"我的这件衣服看起来强壮吗?",
	"在它里面的皇家果冻? 我将会吃他们全部!",
	"有一天你将会了解我如何感觉。 我刚刚想要火鸡。",
	"神秘老奶奶欺骗了你! 她吃了所有的火鸡!",
	"我是神秘老奶奶~! 想要我给你看我的手?",
	"这衣服在我身上看起来更好, 哼!? huhu",
	"我是神秘老奶奶的宠物狼 !",
	"带我的火鸡,然后我会和你结婚!!",
	"哈哈! 你喜欢老年人 加10只火鸡吗? 尝起来很好。。。",
	"什么? 要对抗我? 好 ~",
	"哼!? 哪里 3 小猪去，而且突然你出现。。。?",
	"我在一个狼的皮肤中是一只小羊 .",
	"神秘老奶奶你做这? 或是它力量取出?",
	"我是真正的精灵鼠。在城镇中的那个是假货。",
	"没有火鸡，那就带给我皇家果冻~!!",
	"我看起来像一只火鸡一样吗!!",
	"火鸡全部在我的胃中 ~",
	"火鸡是现在一个我的部份。 ",
	" 给我一只火鸡 , 然后我将不杀你 ~嘿嘿~",
	"快乐的感恩节 ~ 这是莫利 ~",
	"Oo-你是被愚弄的 hehe~ 你认为我是人类的吗?~",
	"纵容! 我将对待你像一只火鸡, 让我们有乐趣! 纵容~~!!"
};


#define MOLLYWOLF_CHAT_DROP_MAX		25
char *szMollyWolfChatDropMsg[MOLLYWOLF_CHAT_DROP_MAX] = {
	"它已经被变坏。 吃下去，将会胃痛。",
	"你认为在伤害我一个快乐的感恩节之后，你能有 ?",
	"Khuhuhuhuhuk!",
	"哦我的天啊! 我只吃了很少的。",
	"我将会不再给你皇家果冻和火鸡 !",
	"如果我死，我不关心。 我已经偷了我想要的每件事物。。。",
	"我将不再忘记这。。。  ",
	"我下次将难倒你。 我下个感恩节将不是那么容易的。",
	"我不是 Moriff 取出! 我没有 宝钻 或相似的东西那~!",
	"你将会在坏火鸡的诅咒之下 !",
	"Ohhh。。莫利总是在我身上摘 T.T",
	" 我想要在感恩节也吃一只好火鸡 T.T",
	"它是我已经偷的面团布丁 .",
	"你也需要有这衣服? T.T",
	" 我厌恶你 , 莫利 ~ T.T",
	"独自吃光火鸡，而且你将会是一头猪。。-_- 用你的宴会分享它~",
	"它没尝起来很好 , 引起莫利烹调了它 .",
	"啊 ~ 你正在杀害我 ~~~ 快乐的感恩节 , 无论如何 ~",
	"Ooh....你下次将会支付这.",
	"好你是最最最最最最棒的。 帮你自己拿一个火鸡。",
	"Ooh~ 我下次将会偷你的衣服 .",
	"Huhu~ 有一只受破坏的火鸡 .",
	"耶稣! 你带了我的火鸡!! 我的朋友将会教你一门课! ",
	"这家伙去杀我即使我给予了他一只火鸡 ~",
	"哦。。。 我支付了力量~"
};

#define SANTAGOBLIN_CHAT_MAX		18
char *szSantaGoblinChatMsg[SANTAGOBLIN_CHAT_MAX] = {
	"不要使我烦乱! 我可能是比较大的!!",
	"圣诞快乐对所有的正在更坏地看的人喜欢我! 而且你不是例外。",
	"你将不拿礼物给圣诞如果你打击我 .",
	"嗨， 你去年放单飞 ?",
	"相信你，和你的女朋友在精灵一起共度美好时间 .",
	"圣诞老人去拿了第 8个老化 , 没有怀疑他失败它 ",
	"它是太多 , 我只在一年中出现一次 .",
	"有美好的新年。。。",
	"我想要让圣诞赋予!!!",
	"我狩猎了鲁道夫而且吃了它~!。",
	"让我们帮助不幸者 .",
	"圣诞快乐!! 请得到如庆祝的击中, 然后我将会给你一个礼物!",
	"我是顽皮的丑小鬼但是使圣诞老人安静 , 我是圣诞老人 ?",
	"在圣诞节诅咒富含乳酪的夫妇!!!",
	"我的身体告诉我它在圣诞节正在去雨 .",
	"如果你打击我 , 你要有女儿看像我 .",
	"我为什么和很多说话? 很好地它是我的工作 !!!",
	"帮助不幸者拿一个项目 ."
};

#define SKILLMASTER_CHAT_MAX		16
char *szSkillMasterChatMsg[SKILLMASTER_CHAT_MAX] = {
	"我将不给你一个自新的机会。 仅仅尽全力。",
      	"我说 , 攻击我比较难的 .",
        "这攻击不够强壮的来对抗一个怪物。 比较难的!!!",
     	"将你的技术和能力集合起来攻击我 !",
     	"攻击是最好的防卫! 使它锐利的和有力!",
       	"不要忘记你的精神! 使用你的强壮身体作一个有力的攻击!",
    	"你无法甚至接近愤怒 !",
   	"和死亡的打架 !",
      	"你已经正在尝试使用核心逃走 ?",
      	"怪物水晶从这里被召唤 , 甚至不想它 !",
       	"如果你得到了偶然造访在北方中的 Pillai 的任何机会 , Raymon 说哈罗 .",
  	"不要仰赖你的设备 , 改为训练你的身体 .",
     	"一非常好! 继续尝试, 前进!",
     	"自从你在这里是第一以后，已经长大这么多 !",
        "你是羞愧用如此棒的设备来制造如此可怕的攻击 .",
      	"你才胳肢我 ."
};

#define MAGICMASTER_CHAT_MAX		16
char *szMagicMasterChatMsg[MAGICMASTER_CHAT_MAX] = {
	"集中你所有的精力, 而且尽量利用攻击 !",
  	"你认为你将会以这该得到精华点 ?",
        "你没有在完全地使用技术! 专注于它!",
     	"你所从我这已经学习的是 ?",
      	"那非常好! 你做了得好!",
        "无面甲的头盔的精神以宗教性者 , 适度的思想为基础! 用清楚的思想把重心集中在你的攻击!",
       	"你无法甚至以这制造擦伤给坏人 !",
      	"你已经正在尝试使用核心逃走 ?",
     	"怪物水晶从不在这里被召唤 , 甚至不想它 !",
        "如果你得到了偶然造访在里查城的任何机会 , 要懂得礼貌.",
    	"甚至最有势力的怪物有一个弱点。 如果你把你的精神训练得很好，你根本不要害怕任何事!",
    	"我正在训练我的弟子.",
     	"你一定要使自己的技术成熟，在击败我之后 .",
      	"自从你在这里是离开以后，已经长大这么多 !",
   	"我觉得好困.",
	"如果你尊敬我如你的主人!!! 停止。。。 huhuhu"
};


char *szMonsterFlagMsg= "怪物出现的地方(%d)[%d]";

#define		SERVER_DOWN_MSG_COUNT	5
char *szServerDownMsg[SERVER_DOWN_MSG_COUNT] = {
	"系统> 请注意下面的提示",
	"系统> 服务器需要停机检修",
	"系统> 请正常地结束游戏以免回档造成损失",
	"系统> 服务器将马上恢复.",
	"系统> 请速正常退出游戏"
};

char *szSeverDownCountMsg = "服务器公告> 还有%d分钟 %d秒时间,服务器将停机检修";

char *srBlessCastle_LeagueMsg_01 = "祝福城堡即将开始。请勇士们准备好参加."; 
char *srBlessCastle_LeagueMsg_02 = "现在祝福城堡正在进行中…… 愿所有的玩家好运气"; 
char *srBlessCastle_LeagueMsg_03 = "祝福城堡是现在结束。 谢谢你参加祝福城堡"; 
char *srBlessCastle_LeagueMsg_04 = "祝福城堡将会在 30 分钟之后被开始。 请准备."; 
char *srBlessCastle_LeagueMsg_05 = "祝福城堡将会在 1 小时之后被开始。 请准备."; 

char *srMsg_StartUser_PresentItem = "我们将会送给你 %活动礼物"; 
char *srMsg_ThanksPolling = "  谢谢参加投票 ";

char *szNotLinkCore = "无法使用公会卷轴";
char *szNotLinkCore2 = "  属于不同公会  ";
char *szNotLinkCore3 = " 由于等级限制无法移动 ";


char	*srMsg_Bl_01	= "使用时间还剩 %d";
char	*srMsg_Bl_02	= "[网吧]";
char	*srMsg_BI_03	= "预约追加日期 [%d年 %d月 %d日] ";
char	*srMsg_BI_04	= "预约追加时间 [%d 小时] ";

char	*srMsg_Bl_100	= "%s使用终止日期  %d年 %d月 %d日 %d点 %d分 %s";
char	*srMsg_Bl_1001	= "%s游戏剩余时间 %d年 %d月 %d日 %d点 0%d分 (GMT).%s";
char	*srMsg_Bl_101	= "%s离使用结束时间还剩  %d 小时 %d分 %s";
char	*srMsg_Bl_102	= "%s离使用结束时间还剩  %d分 %s";


