#include  "..\\HoBaram\\HoTextFile.h"  

char *HoTextLoginMessage[18] =  { "กำลังติดต่อกับ Server.... "  ,
			"ไม่สามารถติดต่อกับ Server ได้ ",
			"กรุณาใส่ ID อีกครั้ง "  ,
			"Password ไม่ถูกต้อง "  ,
			"Server ปิด "  ,
			"ID นี้ถูกใช้งานอยู่ "  ,
			"เวอร์ชั่นไม่ตรง กรุณาโหลด patch ใหม่จาก www.pt.in.th "  ,
			"Server เต็มค่ะ.. "  ,
			"ขาดการติดต่อกับ Server "  ,
			"ท่านหมดเวลาเล่นแล้ว "  ,
			"ท่านหมดเวลาเล่นแล้ว "  ,
			"ลบ Account "  ,
			"Server ไม่สามารถให้บริการได้ขณะนี้  ",
			" โปรดลองเข้าใหม่ภายหลัง...  ",
			"รหัสผ่านผิดเกิน 3 ครั้ง กรุณาตรวจสอบจากหน้าเว็บไซต์ ",
			"ตัวอักษรนี้ไม่สามารถใช้ส่วนหนึ่งของรหัสผ่านได้",
			 };

char *HoTextSelectMessage[12] = { "ต้องการลบ?"  ,
				   "ผจญภัยต่อกับตัวละครนี้? "  ,
				   "จำนวนตัวละครเกิน 5 ตัว "  ,
				   "สร้างตัวละครเรียบร้อย ยืนยัน? "  , 
				   "โปรดใส่ชื่อตัวละคร "  , 
				   "ชื่อนี้ถูกใช้แล้ว "  , 
				   "โปรดเลือกตัวละคร"  , 
				   "โปรดเลือกเผ่า "  , 
				   "โปรดเลือกอาชีพ"  , 
				   "โปรดเลือกหน้าตา "  , 
				   "ไม่สามารถลบหัวหน้า Clan "  , 
				   "หาข้อมูล Clan ไม่พบ "   
				};

char *HoTextTempscronInfo[5] = { "Tempskron เป็นชนชาติที่เชื่อมั่นในพลัง และเทคโนโลยี โดย Tempskron นี้เป็นชนชาติเดียวที่มีความสามารถในการใช้เครื่องมือเทคโนโลยี "  ,
								
                                 "Mechanician เป็นผู้ชำนาญในทางเทคนิคต่างๆ โดยรากฐาน และความสามารถในการสร้าง และควบคุมระบบกลไก "  ,
								 "Fighter กำเนิดมาเพื่อการต่อสู้ มีความสามารถที่เหนือกว่าใครในการต่อสู้ระยะกระชั้นชิด "  ,
								 "Pikeman มีความสามารถในการกำจัดคู่ต่อสู้ได้อย่างรวดเร็ว และรุนแรงด้วยทวน อาวุธอันทรงพลัง "  ,
								 " Archer นักรบหญิงที่เชี่ยวชาญการโจมตีด้วยธนู เป็นที่กล่าวขานในเรื่องความแม่นยำ "  };



char *HoTextMoryon =  "Morion "  ;
char *HoTextMoryonInfo[5] = {
	 "เผ่า Morion อาศัยอยู่ทางตอนเหนือของทวีป บูชาเทพเจ้า Pritos ชนเผ่านี้ ยึดถือ และปฏิบัติตามคำสอนของ Pritos อย่างเคร่งครัด และด้วยจิตใจที่ถูกหล่อหลอม และขัดเกลามาแต่กำเนิด Morion จึงอยู่ในทางแห่งแสงสว่าง "  ,

     "Knight ผู้ที่เชื่อมั่นในพลังของตนเอง ถนัดการต่อสู้ด้วยดาบประเภทต่างๆ Knight สามารถดึงพลังอันศักดิ์สิทธิออกมาในจู่โจมและป้องกันตัวในเวลาที่ใช้ดาบ "  ,
	 "Atalanta ผู้ที่ช่ำชองในการใช้หอก ซึ่งถือเป็นสัญลักษณ์ที่สืบทอดกันมากับชนเผ่า Atalanta มีจุดเด่นในเรื่องทักษะความเร็วเป็นเยี่ยม "  ,
	 "Priestess ผู้สืบสายเลือดบริสุทธิ์ Priestess ปรารถนาที่จะช่วยเหลือผู้คน นอกจากเธอจะมีรูปร่างหน้าตาที่งดงาม แล้วเธอยังเป็นเสมือนตัวแทนแห่งเทพ ซึ่งคอยช่วยเหลือผู้เดือนร้อน "  ,
	 "Magician ผู้ที่แก่กล้าในเวทย์มนต์คาถา และพลังแห่งจิต จุดเด่นของ Magician คือการแต่งกายด้วยชุดคลุม และใช้ คทา ซึ่งเป็นอาวุธจำเป็นในการร่ายเวทย์โดยเฉพาะ "  ,
};


char *HoText_PartyMessage =  "ขอเชิญให้ท่านร่วม Party "  ;

char *HoTextTempskron =  "Tempskron "  ;

char *HoTextFriendNear =  "[ครั้งก่อน] "  ;
char *HoTextFriendList =  "[เพื่อน] %d/%d "  ;
char *HoTextFriendRefuse =  "[Ignored] %d/%d "  ;
